DataProcessors/Renault_ОбновлениеСтепа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ОбновлениеСтепа</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/Renault_ОбновлениеСтепа/Ext/ObjectModule.bsl
Процедура ПроверитьКонстанты() Экспорт
	
	//%+ Дата изменения - 20.08.2013 10:23:55; Автор - Окипний Андрей Евгеньевич
	//
	// Описание изменений
	//  Добавлен алгоритм заполнения константы Дата рализа.
	//
	//%-
	Если обЗначениеНеЗаполнено(Константы.EDR_ДатаРелиза.Получить()) 
		Или Константы.EDR_ДатаРелиза.Получить() < Дата(2013,08,20) тогда
		Константы.EDR_ДатаРелиза.Установить(Дата(2013,08,20));
	КонецЕсли;
	
	//%+ Изменения ДатаИзменения - 16.09.2013 11:46:22, Автор - Окипний Андрей Евгеньевич
	//<xml version="1.0" encoding="UTF-8">
	//<Автодок>
	//<Изменения ДатаИзменения="16.09.2013 11:46:22" Автор="Окипний Андрей Евгеньевич">
	//
	// <Описание>
	//  Добавлено заполнение констант Web-сервиса
	// </Описание>
	//
	//</Изменения>
	//</Автодок>
	//</xml>
	//%-
	Если обЗначениеНеЗаполнено(Константы.Renault_АдресWebСервисов.Получить()) тогда
		
		Константы.Renault_АдресWebСервисов.Установить("http://gate.rnlt.ru/renault-webservices/");
		Константы.Renault_ЛогинВебСервиса.Установить("userWS");
		Константы.Renault_ПарольВебСервиса.Установить("userWS");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьУзлыПлановОбмена() Экспорт
	
	Если Метаданные.ПланыОбмена.Найти("Renault_CRM") <> Неопределено Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Renault_CRM.Ссылка) КАК Количество
		|ИЗ
		|	ПланОбмена.Renault_CRM КАК Renault_CRM");
		КоличествоУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Количество");
		
		Если КоличествоУзлов[0] < 2 тогда //Еще не создавали новые узлы
			ВыборкаПлановCRM = ПланыОбмена.Renault_CRM.Выбрать();
			
			Пока ВыборкаПлановCRM.Следующий() Цикл
				ПланОбъект = ВыборкаПлановCRM.ПолучитьОбъект();
				
				Если НЕ ЗначениеЗаполнено(ПланОбъект.Код) тогда
					
					//Это узел, который создается автоматически в качестве главного
					ПланОбъект.УстановитьНовыйКод();
					ПланОбъект.Наименование = "Эта база - В ОБМЕНЕ НЕ ИСПОЛЬЗОВАТЬ";
					ПланОбъект.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Теперь нужно создать новый узел, в котором будем собирать данные для отправки
			ПланОбъект = ПланыОбмена.Renault_CRM.СоздатьУзел();
			ПланОбъект.Наименование = "Автофрамос";
			ПланОбъект.УстановитьНовыйКод();
			ПланОбъект.Записать();
			Константы.Renault_ПланОбменаCRMПоУмолчанию.Установить(ПланОбъект.Ссылка);
			//Теперь выполним регистрацию объектов
			ПланыОбмена.ЗарегистрироватьИзменения(ПланОбъект.Ссылка);
		Иначе
			Если Не ЗначениеЗаполнено(Константы.Renault_ПланОбменаCRMПоУмолчанию.Получить()) Тогда
				ВыборкаПлановCRM = ПланыОбмена.Renault_CRM.Выбрать();
				
				Пока  ВыборкаПлановCRM.Следующий() Цикл
					Если Не( ВыборкаПлановCRM.Наименование = "Эта база - В ОБМЕНЕ НЕ ИСПОЛЬЗОВАТЬ") Тогда
						Константы.Renault_ПланОбменаCRMПоУмолчанию.Установить(ВыборкаПлановCRM.Ссылка);
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	////$+ Комментарий 
	// Дата создания - 18.09.2014;
	// Автор - Ерошин Евгений Александрович
	//
	//Добавлены блоки первоначальной инициализации для новых объектов.
	// 1. Создание планов обмена для Автосервиса
	//
	//$-
	Если Метаданные.ПланыОбмена.Найти("Renault_Автосервис") <> Неопределено Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Renault_Автосервис.Ссылка) КАК Количество
		|ИЗ
		|	ПланОбмена.Renault_Автосервис КАК Renault_Автосервис");
		КоличествоУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Количество");
		
		Если КоличествоУзлов[0] < 2 тогда //Еще не создавали новые узлы
			ВыборкаПлановАвтосервис = ПланыОбмена.Renault_Автосервис.Выбрать();
			
			Пока ВыборкаПлановАвтосервис.Следующий() Цикл
				ПланОбъект = ВыборкаПлановАвтосервис.ПолучитьОбъект();
				
				Если НЕ ЗначениеЗаполнено(ПланОбъект.Код) тогда
					
					//Это узел, который создается автоматически в качестве главного
					ПланОбъект.УстановитьНовыйКод();
					ПланОбъект.Наименование = "Эта база - В ОБМЕНЕ НЕ ИСПОЛЬЗОВАТЬ";
					ПланОбъект.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Теперь нужно создать новый узел, в котором будем собирать данные для отправки
			ПланОбъект = ПланыОбмена.Renault_Автосервис.СоздатьУзел();
			ПланОбъект.Наименование = "Автофрамос";
			ПланОбъект.УстановитьНовыйКод();
			ПланОбъект.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	// 2. Создание планов обмена для Гарантии
	//
	//$-
	Если Метаданные.ПланыОбмена.Найти("Renault_Гарантия") <> Неопределено Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Renault_Гарантия.Ссылка) КАК Количество
		|ИЗ
		|	ПланОбмена.Renault_Гарантия КАК Renault_Гарантия");
		КоличествоУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Количество");
		
		Если КоличествоУзлов[0] < 2 тогда //Еще не создавали новые узлы
			ВыборкаПлановГарантия = ПланыОбмена.Renault_Гарантия.Выбрать();
			
			Пока ВыборкаПлановГарантия.Следующий() Цикл
				ПланОбъект = ВыборкаПлановГарантия.ПолучитьОбъект();
				
				Если НЕ ЗначениеЗаполнено(ПланОбъект.Код) тогда
					
					//Это узел, который создается автоматически в качестве главного
					ПланОбъект.УстановитьНовыйКод();
					ПланОбъект.Наименование = "Эта база - В ОБМЕНЕ НЕ ИСПОЛЬЗОВАТЬ";
					ПланОбъект.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Теперь нужно создать новый узел, в котором будем собирать данные для отправки
			ПланОбъект = ПланыОбмена.Renault_Гарантия.СоздатьУзел();
			ПланОбъект.Наименование = "Автофрамос";
			ПланОбъект.УстановитьНовыйКод();
			ПланОбъект.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	// 3. Создание планов обмена для Контакт-центра
	//
	//$-
	Если Метаданные.ПланыОбмена.Найти("Renault_ContactCenter") <> Неопределено Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Renault_ContactCenter.Ссылка) КАК Количество
		|ИЗ
		|	ПланОбмена.Renault_ContactCenter КАК Renault_ContactCenter");
		КоличествоУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Количество");
		
		Если КоличествоУзлов[0] < 2 тогда //Еще не создавали новые узлы
			ВыборкаПлановContactCenter = ПланыОбмена.Renault_ContactCenter.Выбрать();
			
			Пока ВыборкаПлановContactCenter.Следующий() Цикл
				ПланОбъект = ВыборкаПлановContactCenter.ПолучитьОбъект();
				
				Если НЕ ЗначениеЗаполнено(ПланОбъект.Код) тогда
					
					//Это узел, который создается автоматически в качестве главного
					ПланОбъект.УстановитьНовыйКод();
					ПланОбъект.Наименование = "Эта база - В ОБМЕНЕ НЕ ИСПОЛЬЗОВАТЬ";
					ПланОбъект.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Теперь нужно создать новый узел, в котором будем собирать данные для отправки
			ПланОбъект = ПланыОбмена.Renault_ContactCenter.СоздатьУзел();
			ПланОбъект.Наименование = "Автофрамос";
			ПланОбъект.УстановитьНовыйКод();
			ПланОбъект.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	// 4. Создание планов обмена для АФМ
	//
	//$-
	Если Метаданные.ПланыОбмена.Найти("Renault_ИзмененияДанныхАФМ") <> Неопределено Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Renault_ИзмененияДанныхАФМ.Ссылка) КАК Количество
		|ИЗ
		|	ПланОбмена.Renault_ИзмененияДанныхАФМ КАК Renault_ИзмененияДанныхАФМ");
		КоличествоУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Количество");
		
		Если КоличествоУзлов[0] < 2 тогда //Еще не создавали новые узлы
			ВыборкаПлановАФМ = ПланыОбмена.Renault_ИзмененияДанныхАФМ.Выбрать();
			
			Пока ВыборкаПлановАФМ.Следующий() Цикл
				ПланОбъект = ВыборкаПлановАФМ.ПолучитьОбъект();
				
				Если НЕ ЗначениеЗаполнено(ПланОбъект.Код) тогда
					
					//Это узел, который создается автоматически в качестве главного
					ПланОбъект.УстановитьНовыйКод();
					ПланОбъект.Наименование = "Эта база - В ОБМЕНЕ НЕ ИСПОЛЬЗОВАТЬ";
					ПланОбъект.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
			//Теперь нужно создать новый узел, в котором будем собирать данные для отправки
			ПланОбъект = ПланыОбмена.Renault_ИзмененияДанныхАФМ.СоздатьУзел();
			ПланОбъект.Наименование = "Автофрамос";
			ПланОбъект.УстановитьНовыйКод();
			ПланОбъект.Записать();
			
			Константы.Renault_УзелРегистрацииИзмененийДанныхАФМ.Установить(ПланОбъект.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет приведение регистра сведений "Контактная информация" к виду - 
// один клиент:один телефон по умолчанию, одна почта по умолчанию
// эти значения в дальнейшем используются во всех местах
Процедура ВыполнитьКорректировкуРегистраКонтактнойИнформации()
	
	Сообщить("Пожалуйста, подождите. Выполняются операции, связанные с обновлением программы.");
	
	// получим контрагентов и потенциальных контрагентов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Клиент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Потенциальные.Ссылка
	|ИЗ
	|	Справочник.CRM_ПотенциальныеКонтрагенты КАК Потенциальные";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	КоличествоОбщее = Выборка.Количество();
	Процент = Окр(КоличествоОбщее/100);
	НомерПроцента = 1;
	НомерКонтрагента = 0;
	
	// по каждому клиенту обработаем наборы КИ
	Пока Выборка.Следующий() Цикл
		
		///////Телефоны
		Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Выборка.Клиент);
		Набор.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		Набор.Прочитать();
		Набор.ОбменДанными.Загрузка = Истина;
		Если Набор.Количество() Тогда // есть телефоны
			
			ЕстьОсновнойТелефон = Ложь;
			ЗаписьОсновнойСотовый = Неопределено;
			ЗаписьСотовый = Неопределено;
			КоличествоОсновныхТелефонов = 0;
			
			Для Каждого Запись ИЗ Набор Цикл
				Если Запись.ЗначениеПоУмолчанию Тогда
					КоличествоОсновныхТелефонов = КоличествоОсновныхТелефонов + 1;
					Если Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый Тогда
						ЗаписьОсновнойСотовый = Запись;
					КонецЕсли;
				КонецЕсли;
				Если Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый Тогда
					ЗаписьСотовый = Запись;
				КонецЕсли;
			КонецЦикла;
			
			Если КоличествоОсновныхТелефонов = 1 Тогда
				
				// все ок, ничего не трогаем
				
			ИначеЕсли КоличествоОсновныхТелефонов > 1 Тогда
				
				Если ЗаписьОсновнойСотовый <> Неопределено Тогда
					Для Каждого Запись ИЗ Набор Цикл
						Если Запись.ЗначениеПоУмолчанию И Запись <> ЗаписьОсновнойСотовый Тогда
							Запись.ЗначениеПоУмолчанию = Ложь;
						КонецЕсли;
					КонецЦикла;
				Иначе //нет основого сотового, берем первый, у остальных снимаем признак
					ЕстьОсновнойТелефон = Ложь;
					Для Каждого Запись ИЗ Набор Цикл
						Если НЕ ЕстьОсновнойТелефон Тогда
							Если Запись.ЗначениеПоУмолчанию Тогда
								ЕстьОсновнойТелефон = Истина;
							КонецЕсли;
						Иначе // уже есть один основной
							Запись.ЗначениеПоУмолчанию = Ложь;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
			ИначеЕсли КоличествоОсновныхТелефонов = 0 Тогда
				
				Если ЗаписьСотовый <> Неопределено Тогда
					ЗаписьСотовый.ЗначениеПоУмолчанию = Истина;
				Иначе
					Набор[0].ЗначениеПоУмолчанию = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Набор.Записать();
			
		КонецЕсли;
		
		///////Почта
		Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		Набор.Отбор.Объект.Установить(Выборка.Клиент);
		Набор.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		Набор.Прочитать();
		Набор.ОбменДанными.Загрузка = Истина;

		Если Набор.Количество() Тогда // есть почта
			
			ЕстьОсновнойEmail = Ложь;
			ЗаписьОсновнойEmail = Неопределено;
			ЗаписьEmail = Неопределено;
			КоличествоОсновныхEmail = 0;
			
			Для Каждого Запись ИЗ Набор Цикл
				Если Запись.ЗначениеПоУмолчанию Тогда
					КоличествоОсновныхEmail = КоличествоОсновныхEmail + 1;
					Если Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний Тогда
						ЗаписьОсновнойEmail = Запись;
					КонецЕсли;
				КонецЕсли;
				Если Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний Тогда
					ЗаписьEmail = Запись;
				КонецЕсли;
			КонецЦикла;
			
			Если КоличествоОсновныхEmail = 1 Тогда
				
				// все ок, ничего не трогаем
				
			ИначеЕсли КоличествоОсновныхEmail > 1 Тогда
				
				Если ЗаписьОсновнойEmail <> Неопределено Тогда
					Для Каждого Запись ИЗ Набор Цикл
						Если Запись.ЗначениеПоУмолчанию И Запись <> ЗаписьОсновнойEmail Тогда
							Запись.ЗначениеПоУмолчанию = Ложь;
						КонецЕсли;
					КонецЦикла;
				Иначе //нет основой почты, берем первый, у остальных снимаем признак
					ЕстьОсновнойEmail = Ложь;
					Для Каждого Запись ИЗ Набор Цикл
						Если НЕ ЕстьОсновнойEmail Тогда
							Если Запись.ЗначениеПоУмолчанию Тогда
								ЕстьОсновнойEmail = Истина;
							КонецЕсли;
						Иначе // уже есть один основной
							Запись.ЗначениеПоУмолчанию = Ложь;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
			ИначеЕсли КоличествоОсновныхEmail = 0 Тогда
				
				Если ЗаписьEmail <> Неопределено Тогда
					ЗаписьEmail.ЗначениеПоУмолчанию = Истина;
				Иначе
					Набор[0].ЗначениеПоУмолчанию = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Набор.Записать();
			
		КонецЕсли;
		
		//НомерКонтрагента = НомерКонтрагента + 1;
		//Если НомерКонтрагента = Процент*НомерПроцента Тогда
		//	Сообщить("Обработано " + НомерПроцента + "%");
		//	НомерПроцента = НомерПроцента + 1;
		//ИначеЕсли НомерКонтрагента = КоличествоОбщее Тогда
		//	Сообщить("Обработано " + "100%");
		//КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Процедура ВыполнитьДействияПриИзмененииВерсииCRM()
//Выполняет пошагово заданные действия в зависимости от версии CRM
//
Процедура ВыполнитьДействияПриИзмененииВерсииCRM()
	
	ВерсияCRM_Старая = Константы.CRM_Версия_Renault.Получить();
	ВерсияCRM_Новая = "1.1.9";
	
	Если ВерсияCRM_Старая <> ВерсияCRM_Новая Тогда
		
		Если ВерсияCRM_Новая = "0.9.14" Тогда
			
			Обработка = Обработки.Renault_ПереносНастроек.Создать();
			Обработка.НачатьПеренос();
			
		ИначеЕсли ВерсияCRM_Новая = "0.9.15" Тогда
						
			//Ничего не делаем
			
		ИначеЕсли ВерсияCRM_Новая = "1.1.0" Тогда
			
			//Ничего не делаем
			
		ИначеЕсли ВерсияCRM_Новая = "1.1.2" Тогда
			
			//Ничего не делаем
			
		ИначеЕсли ВерсияCRM_Новая = "1.1.2" Тогда
			
			//Ничего не делаем
			
		ИначеЕсли ВерсияCRM_Новая = "1.1.3" Тогда
			
			//Ничего не делаем
			
		ИначеЕсли ВерсияCRM_Новая = "1.2.2" Тогда
			
			//Ничего не делаем
			
		КонецЕсли;
		
		Константы.CRM_Версия_Renault.Установить(ВерсияCRM_Новая);
		
		//Временно
		Если ВерсияCRM_Старая = "0.9.12" ИЛИ ВерсияCRM_Старая = "0.9.13" ИЛИ ВерсияCRM_Старая = "0.9.14" Тогда		
			ВыполнитьКорректировкуРегистраКонтактнойИнформации();
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьТипыТрафикаВДЦ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CRM_ДилерскиеЦентрыНастройкиРегистрацииТрафика.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_ДилерскиеЦентры.НастройкиРегистрацииТрафика КАК CRM_ДилерскиеЦентрыНастройкиРегистрацииТрафика
	|ГДЕ
	|	CRM_ДилерскиеЦентрыНастройкиРегистрацииТрафика.ТипТрафика В (&МассивТипов)";
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Справочники.CRM_ТипТрафика.ЛидRenault);
	МассивТипов.Добавить(Справочники.CRM_ТипТрафика.Email);
	Запрос.УстановитьПараметр("МассивТипов", МассивТипов);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДЦОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаТипыТрафика ИЗ ДЦОбъект.НастройкиРегистрацииТрафика Цикл
			Если СтрокаТипыТрафика.ТипТрафика = Справочники.CRM_ТипТрафика.ЛидRenault Тогда
				СтрокаТипыТрафика.ТипТрафика = Справочники.CRM_ТипТрафика.ЛидДилера;
			ИначеЕсли СтрокаТипыТрафика.ТипТрафика = Справочники.CRM_ТипТрафика.Email Тогда
				СтрокаТипыТрафика.ТипТрафика = Справочники.CRM_ТипТрафика.EmailДилера;
			КонецЕсли;
		КонецЦикла;
		ДЦОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

////@+ Процедура ВыполнитьПроверкуСтепа()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры="Экспорт"
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="26.09.2013 10:19:58" Автор="Окипний Андрей Евгеньевич">
// <Имя>ВыполнитьПроверкуСтепа()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</Автодок>
//</xml>
//@-
Процедура ВыполнитьПроверкуСтепа() Экспорт
	
	ПроверитьКонстанты();
	
	ПроверитьУзлыПлановОбмена();
	
	ВыполнитьДействияПриИзмененииВерсииCRM();
	
	ПроверитьТипыТрафикаВДЦ();
	
КонецПроцедуры // ВыполнитьПроверкуСтепа()
